In [143]:
import numpy as np
import pandas as pd

In [144]:
pd.options.display.float_format = '{:.2f}'.format
a1 = ['송중기', '국어', 89]
a2 = ['김나현', '영어', 42]
a3 = ['박효신', '국어', 78]
a4 = ['김범수', '영어', 61]
a5 = ['권보아', '국어', 91]
a6 = ['한동근', '영어', 38]

df1 = pd.DataFrame([a1, a2, a3, a4, a5, a6], columns=["이름", "과목", "점수"])
df2 = df1.copy()
df3 = df1.copy()
s1 = pd.DataFrame([1, 2, 3, 4, 5, 6], columns=["s1"])

In [145]:
df1

    이름  과목  점수
0  송중기  국어  89
1  김나현  영어  42
2  박효신  국어  78
3  김범수  영어  61
4  권보아  국어  91
5  한동근  영어  38

In [146]:
df1.groupby('과목')['점수'].agg('mean')

과목
국어   86.00
영어   47.00
Name: 점수, dtype: float64

In [147]:
df1['과목평균'] = df1.groupby('과목')['점수'].transform('mean')
df1

    이름  과목  점수  과목평균
0  송중기  국어  89 86.00
1  김나현  영어  42 47.00
2  박효신  국어  78 86.00
3  김범수  영어  61 47.00
4  권보아  국어  91 86.00
5  한동근  영어  38 47.00

In [148]:
df1[df1['점수'] > df1['과목평균']]

    이름  과목  점수  과목평균
0  송중기  국어  89 86.00
3  김범수  영어  61 47.00
4  권보아  국어  91 86.00

In [149]:
df3['점수'].transform(lambda x : x )
# 여기서 알 수 있는 것은 x가 점수라는 사실
# file:///C:/Users/Public/Documents/PANDAS_Document/reference/api/pandas.Series.transform.html

0    89
1    42
2    78
3    61
4    91
5    38
Name: 점수, dtype: int64

In [150]:
df3.groupby('과목')['점수'].transform(lambda x : x.mean())
# 여기서 알 수 있는 것은 grouping되어 있다면 "함수"를 각 row의 각항(column)에 적용할 수 있다.
# grouping되어 있지 않으면 agg함수는 쓸 수 없다.(이상하지 💥)

0   86.00
1   47.00
2   86.00
3   47.00
4   86.00
5   47.00
Name: 점수, dtype: float64

In [153]:
df3.groupby('과목')['점수'].transform(lambda x : x > x.mean())

0     True
1    False
2    False
3     True
4     True
5    False
Name: 점수, dtype: bool

In [151]:
df3[df3.groupby('과목')['점수'].transform(lambda x : x > x.mean())]

    이름  과목  점수
0  송중기  국어  89
3  김범수  영어  61
4  권보아  국어  91

In [152]:
df3.groupby('과목')['점수'].transform('mean')
# grouping되어 있으니  group별로 함수를 적용하는(x.mean())

0   86.00
1   47.00
2   86.00
3   47.00
4   86.00
5   47.00
Name: 점수, dtype: float64